'''
ChatGPT и DeepSeek, вдохновленные итальянским брейнрот-хумором, решили заполнить 
Интернет своими бесконечными каламбурами. Они придумали схему: берут N слов и склеивают
их в одно мега-слово, чтобы весь Интернет страдал от их гениальности, и человечество 
отказалось от его использования. Правила склейки таковы:

Если два слова идут подряд, самый длинный общий префикс второго слова, совпадающий с 
суффиксом первого, удаляется.
Например, слова "fiasco" и "scorpion" склеиваются в "fiascorpion", потому что префикс 
"sco" второго слова совпадает с суффиксом "sco" первого. Склейка идет строго слева 
направо: сначала склеиваются первые два слова, затем результат с третьим, и так далее.
Формат ввода
Первая строка содержит одно целое число 
n (1≤n≤105) - количество слов. Вторая строка содержит 
n слов, разделенных единичными пробелами. Каждое слово 
непусто и состоит из строчных латинских букв. Суммарная длина слов не превосходит 10**6

Формат вывода
Выведите в выходной файл полученный каламбур
'''

n = int(input())
words = input().split()
def find_common(a, b):
    max_len = min(len(a), len(b))
    a_hash = 0
    b_hash = 0
    p = 10**18 + 3
    base = 911382629
    max_overlap = 0
    power = 1 

    for l in range(1, max_len + 1):
        a_char = ord(a[-l])
        a_hash = (a_hash * base + a_char) % p
        b_char = ord(b[l-1])
        b_hash = (b_hash + b_char * power) % p
        power = (power * base) % p
        if a_hash == b_hash:
            max_overlap = l
    return max_overlap
if n == 0:
    print('')
else:
    result = words[0]
    for word in words[1:]:
        overlap = find_common(result, word)
        result += word[overlap:]
    print(result)