'''руппа решила вернуться в Долгопрудный с предпосвята на электричке до Новодачной. 
Они хотят добраться до дома как можно быстрее. Однако по какой-то причине не все поезда 
идут от локации предпосвята до Долгопрудного. Даже если поезд проходит через их станцию, 
он может не остановиться на ней (так же, как и на других станциях, мимо которых он проезжает).

Все станции на железнодорожной линии пронумерованы от 1 до n. На станции с номером 1 
изначально находится группа, станция Новодачная имеет номер e.

Напишите программу, которая по заданному расписанию движения поездов определяет минимальное время, 
за которое участники смогут добраться до своей станции.

Формат ввода
В первой строке числа n (2 ≤ n ≤ 100) и e (2 ≤ e ≤ n) и m (0 ≤ m ≤ 100), обозначающее число рейсов
электричек. Далее идет описание m рейсов электричек каждое на отдельное строке. Первое число в 
строке ki (2 ≤ ki ≤ n) – количество станций, на которых эл-ка останавливается, а далее следует 
ki пар чисел, первое число каждой пары задает номер станции, второе – время, когда электричка 
останавливается на этой станции (время выражается целым числом из диапазона от 0 до 10^9).
Станции внутри одного рейса упорядочены в порядке возрастания времени. В течение одного рейса 
электричка все время движется в одном направлении -- либо в сторону Долгопрудного, либо от него.

Формат вывода
Выведите одно число – минимальное время, через которое группа сможет вернуться в Долгопрудный. 
Если существующими рейсами электричек они добраться не смогут, выведите -1.'''

n, e, m = map(int, input().split())
pa = []
for i in range(m):
    inf = list(map(int, input().split()))[1:]
    pa.append(inf)
mf = {}
ways = {}

for i in range(n):
    mf[i + 1] = -1
    ways[i + 1] = []
mf[1] = 0
for el in pa:
    for i in range(1, len(el) // 2):
        ways[el[2 * (i - 1)]].append([el[2 * i], el[2 * i - 1], el[2 * i + 1]])
visited = [False] * (n+1)


def solve(start):
    stack = [start]
    while stack:
        cur = stack.pop()
        for ii in ways[cur]:
            if not visited[cur]:
                stack = [ii[0]] + stack
                if mf[cur] != -1 and mf[cur] <= ii[1]:
                    mf[ii[0]] = ii[2] if mf[ii[0]] == -1 else min(
                        mf[ii[0]], ii[2])
        visited[cur] = True


solve(1)
print(mf[e])