'''Дан ориентированный невзвешенный граф. Определите, существует ли у него единственная 
топологическая сортировка.

Формат ввода
В первой строке содержатся количество вершин N (1 ≤ n ≤ 2 * 10^5) и количество рёбер M 
(1 ≤ m ≤ 10^5) в графе. В следующих M строках задаются рёбра графа, каждое -- парой чисел, 
номерами начальной и конечной вершины. Вершины нумеруются с 1.

Формат вывода
Выведите “YES”, если существует единственная топологическая сортировка вершин графа, и “NO”
если существует несколько вариантов сортировки. Если топологическая сортировка невозможна, выведите -1.
'''

q = []
ans = []
k = True
n, m = map(int, input().split())
l = [[] for _ in range(n + 1)]
lo = [0] * (n + 1)
for i in range(m):
    u, v = map(int, input().split())
    l[u].append(v)
    lo[v] += 1
for i in range(1, n + 1):
    if lo[i] == 0:
        q.append(i)
while q:
    if len(q) > 1:
        k = False  
    u = q.pop()
    ans.append(u)
    for v in l[u]:
        lo[v] -= 1
        if lo[v] == 0:
            q.append(v)
            
if len(ans) != n:
    print("-1")
else:
    if k:
        print("YES")
    else:
        print( "NO")
